# Các thông số cơ bản cho bài toán lá sắn
nc: 1 # BẮT BUỘC sửa thành 1 (chỉ có 1 lớp duy nhất là unhealthy)
names: ["unhealthy"]

# Định nghĩa các tỉ lệ mô hình (Dùng bản 's' để cân bằng P và tốc độ)
scales:
  s: [0.33, 0.50, 1024]

backbone:
  # [từ đâu, số lượng, tên khối, thông số]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2 (Tầng nông, giữ C2f thường cho nhẹ)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_DualSK, [256, True]] # 4-P3 (Cấy DualSK bắt đặc trưng quy mô vừa)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_DualSK, [512, True]] # 6-P4 (Cấy DualSK bắt đặc trưng quy mô lớn)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_DualSK, [1024, True]] # 8-P5 (Dùng Attention nhìn bao quát toàn bộ lá)
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11: Gộp thông tin từ tầng 6 (P4)
  - [-1, 3, C2f_DualSK, [512]] # 12: Chốt chặn 1 - Lọc nhiễu sau khi gộp đặc trưng

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14: Gộp thông tin từ tầng 4 (P3)
  - [-1, 3, C2f_DualSK, [256]] # 15: Chốt chặn 2 - Quan trọng nhất để tăng Precision cho đốm nhỏ

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 15], 1, Concat, [1]] # 17: Quay ngược lại kết nối với tầng 15
  - [-1, 3, C2f, [512]] # 18: Để C2f thường để tránh bùng nổ than số ở cuối

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 12], 1, Concat, [1]] # 20: Quay ngược lại kết nối với tầng 12
  - [-1, 3, C2f, [1024]] # 21: Để C2f thường

  - [[18, 21, 24], 1, Detect, [nc]] # 22: Lớp Detect cuối cùng (kiểm tra lại index nếu lỗi)
