# YOLOv8-Ghost-DualSK (Tập trung Precision)
nc: 1 
scales:
  [cite_start]n: [0.33, 0.25, 1024] # Dùng scale Nano để thắng bản gốc về FPS [cite: 287]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [cite_start][-1, 1, GhostConv, [512, 3, 2]] # 5-P4/16 [cite: 349]
  - [cite_start][-1, 6, C2f_Ghost_DualSK, [512, True]] # 6 - Lọc nhiễu mạnh tại đây [cite: 346]
  - [cite_start][-1, 1, GhostConv, [1024, 3, 2]] # 7-P5/32 [cite: 439]
  - [-1, 3, C2f_Ghost_DualSK, [1024, True]] # 8 - Tầng sâu nhất để tăng P
  - [-1, 1, SPPF, [1024, 5]]        # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  
  - [cite_start][-1, 3, C2f, [512]]              # Giảm độ phức tạp ở Head để tăng FPS [cite: 401]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  
  - [cite_start][-1, 3, C2f, [256]]              # Neck gọn gàng [cite: 409]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
